#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_dns_cname_record.cloudfront will be updated in-place
  ~ resource "azurerm_dns_cname_record" "cloudfront" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/dnsZones/io.italia.it/CNAME/firma"
        name                = "firma"
      ~ tags                = {
          - "BusinessUnit"   = "App IO" -> null
          ~ "CostCenter"     = "TS000 - Tecnologia e Servizi" -> "BD100 - STRATEGIC INNOVATION"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
          - "ManagementTeam" = "IO Platform" -> null
          + "Owner"          = "IO"
          ~ "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod" -> "https://github.com/pagopa/io-infra/src/sign"
        }
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.firmaconio_selfcare_apim_contributor_role will be created
  + resource "azurerm_role_assignment" "firmaconio_selfcare_apim_contributor_role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6fb591dc-9cd4-4d5a-8903-6389d96af660"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "API Management Service Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.firmaconio_selfcare_staging_apim_contributor_role will be created
  + resource "azurerm_role_assignment" "firmaconio_selfcare_staging_apim_contributor_role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c44b5cc2-8342-4403-adc7-56113a3b511f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "API Management Service Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.io_sign_backoffice_app.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-backend-rg/providers/Microsoft.Web/sites/io-p-sign-backoffice-app"
        name                                           = "io-p-sign-backoffice-app"
        tags                                           = {
            "CostCenter"                                     = "BD100 - STRATEGIC INNOVATION"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-infra/src/sign"
        }
        # (22 unchanged attributes hidden)

      ~ site_config {
            # (25 unchanged attributes hidden)

          ~ ip_restriction {
                name                      = "rule"
              ~ virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/apimv2api" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
                # (3 unchanged attributes hidden)
            }
          ~ ip_restriction {
                name                      = "rule"
              ~ virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/apimv2api" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
                # (3 unchanged attributes hidden)
            }

            # (3 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.io_sign_backoffice_app_staging_slot.azurerm_linux_web_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "APIM_RESOURCE_GROUP_NAME"        = "io-p-rg-internal" -> "io-p-itn-common-rg-01"
          ~ "APIM_SERVICE_NAME"               = "io-p-apim-v2-api" -> "io-p-itn-apim-01"
            # (14 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-backend-rg/providers/Microsoft.Web/sites/io-p-sign-backoffice-app/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"  = "BD100 - STRATEGIC INNOVATION"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra/src/sign"
        }
        # (20 unchanged attributes hidden)

      ~ site_config {
            # (25 unchanged attributes hidden)

          ~ ip_restriction {
                name                      = "rule"
              ~ virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/apimv2api" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
                # (3 unchanged attributes hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.io_sign_issuer_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-backend-rg/providers/Microsoft.Web/sites/io-p-sign-issuer-func"
        name                                           = "io-p-sign-issuer-func"
        tags                                           = {
            "CostCenter"                                     = "BD100 - STRATEGIC INNOVATION"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-infra/src/sign"
        }
        # (28 unchanged attributes hidden)

      ~ site_config {
            # (27 unchanged attributes hidden)

          ~ ip_restriction {
                name                      = "rule"
              ~ virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/apimv2api" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
                # (3 unchanged attributes hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.io_sign_issuer_func_staging_slot[0].azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-backend-rg/providers/Microsoft.Web/sites/io-p-sign-issuer-func/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "BD100 - STRATEGIC INNOVATION"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-infra/src/sign"
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
            # (27 unchanged attributes hidden)

          ~ ip_restriction {
                name                      = "rule"
              ~ virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/apimv2api" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
                # (3 unchanged attributes hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.io_sign_support_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-backend-rg/providers/Microsoft.Web/sites/io-p-sign-support-func"
        name                                           = "io-p-sign-support-func"
        tags                                           = {
            "CostCenter"                                     = "BD100 - STRATEGIC INNOVATION"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-infra/src/sign"
        }
        # (28 unchanged attributes hidden)

      ~ site_config {
            # (26 unchanged attributes hidden)

          ~ ip_restriction {
                name                      = "rule"
              ~ virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/apimv2api" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
                # (3 unchanged attributes hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.io_sign_support_func_staging_slot[0].azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-backend-rg/providers/Microsoft.Web/sites/io-p-sign-support-func/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"  = "BD100 - STRATEGIC INNOVATION"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra/src/sign"
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
            # (26 unchanged attributes hidden)

          ~ ip_restriction {
                name                      = "rule"
              ~ virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/apimv2api" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
                # (3 unchanged attributes hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

Plan: 2 to add, 7 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cosmosdb_account.azurerm_cosmosdb_account.this,
  on .terraform/modules/cosmosdb_account/cosmosdb_account/main.tf line 7, in resource "azurerm_cosmosdb_account" "this":
   7:   enable_free_tier          = var.enable_free_tier

This property has been superseded by `free_tier_enabled` and will be removed
in v4.0 of the AzureRM Provider

(and 23 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
